/*0:继续前进，-1：左转 1：右转 
3:前进一格处地上有能量环 4：左转一格处地上有能量环 5：右转一格处地上有能量环 
6：前进一格处增益环 7：左转一格处增益环 8：右转一格处增益环
9：前进一格处得分柱 10：左转一格处得分柱 11：右转一格处得分柱
99：数组末尾标志*/
//int specificline[20]={1,0,-1,0,-1,0,-1,0,0,99};
//int specificline[20]={0,11,99};
int specificline[40]={5,0,4,0,0,10,-1,0,5,1,3,11,4,0,3,-1,-1,0,0,1,0,9,0,-1,0,0,6,5,1,0,0,0,11,99};
//int specificline[40]={1,0,-1,-1,-1,1,-1,99};
//int specificline[40]={4,0,3,-1,-1,0,0,1,0,9,99};
int* crossmark = specificline;

//套柱子的距离是12
//步进电机比标记高120°为初始位置

//int capture_range= ;

//表示位置的数据矩阵写好






